var list = {
    "北京市": {
        "北京": [
            "北京北海医院",
            "北京国际医疗中心",
            "北京恒安中医院",
            "北京建国医院",
            "北京健宫医院",
            "北京京北医院",
            "北京京城皮肤病医院",
            "北京玛丽妇婴医院",
            "北京麦瑞骨科医院",
            "北京美联臣医疗美容医院",
            "北京年轮中医骨科医院",
            "北京前海股骨头医院",
            "北京瑞京糖尿病医院",
            "北京市慧慈医院",
            "北京天伦不孕不育医院",
            "北京五洲女子医院"
        ]
    },
    "天津市": {
        "天津": [
            "天津华北医院",
            "天津华厦医院",
            "天津华山医院",
            "天津坤如玛丽医院",
            "天津乐园医院",
            "天津现代女子医院",
            "天津怡泰医院",
            "天津长庚耳鼻喉医院"
        ]
    },
    "贵州省": {
        "贵阳": [
            "贵阳和美妇产医院",
            "贵阳和谐阳光医院",
            "贵阳马王庙医院",
            "贵阳现代女子医院",
            "贵阳长江医院",
            "贵州退休医师医院"
        ],
        "安顺": [
            "安顺阳光妇科医院"
        ],
        "遵义": [
            "遵义女子医院"
        ],
        "铜仁": [
            "铜仁华夏医院"
        ]
    },
    "河南省": {
        "洛阳": [
            "解放军534医院",
            "洛阳牡丹女子医院"
        ],
        "许昌": [
            "许昌凤凰医院",
            "许昌新时代妇科医院",
            "许昌中山医院"
        ],
        "安阳": [
            "安阳协和医院"
        ],
        "郑州": [
            "巩义阳光医院",
            "河南中都皮肤病医院",
            "郑州华山医院",
            "郑州华夏白癜风医院",
            "郑州集美整形美容医院"
        ],
        "信阳": [
            "信阳泌尿外科医院"
        ],
        "漯河": [
            "漯河东方医院"
        ]
    },
    "山东省": {
        "青岛": [
            "青岛妇婴医院",
            "青岛集美整形美容医院",
            "青岛玛丽妇产医院",
            "青岛曙光男科医院",
            "青岛新阳光医院",
            "青岛长征医院",
            "青岛曙光医院"
        ],
        "聊城": [
            "聊城东昌府三医院"
        ],
        "淄博": [
            "山东淄博金盾医院",
            "淄博女子医院"
        ],
        "威海": [
            "威海现代女子医院"
        ],
        "德州": [
            "齐河阳光医院"
        ],
        "潍坊": [
            "潍坊和平医院",
            "潍坊长安医院",
            "诸城博爱医院"
        ],
        "济南": [
            "济南妇科医院",
            "济南骨科医院",
            "济南华夏医院",
            "济南乳腺医院",
            "济南阳光女子医院",
            "济南整形美容医院",
            "山东红十字会医院"
        ]
    },
    "四川省": {
        "凉山": [
            "凉山妇产医院",
            "凉山男科医院"
        ],
        "雅安": [
            "解放军第三十七医院"
        ],
        "成都": [
            "成都安琪儿妇产医院",
            "成都博爱医院",
            "成都华美紫馨医学美容医院",
            "成都济民妇科医院",
            "成都欧亚男科医院",
            "成都蜀都乳腺医院",
            "成都曙光男科医院",
            "成都送子鸟不孕不育医院",
            "成都糖尿病专科医院",
            "成都长征医院",
            "四川阳光妇科医院"
        ]
    },
    "江苏省": {
        "淮安": [
            "淮安幸福医院",
            "江苏淮安中山医院"
        ],
        "无锡": [
            "江阴东方女子医院",
            "江阴九龙泌尿外科医院",
            "无锡虹桥医院",
            "无锡嘉仕恒信医院",
            "无锡玛丽亚医院",
            "无锡南站医院",
            "无锡新区医院"
        ],
        "南京": [
            "江苏施尔美整形美容医院",
            "南京建国男科医院",
            "南京江宁博爱医院",
            "南京康豪妇科",
            "南京世纪现代妇产医院",
            "南京市江宁区众彩门诊部",
            "南京曙光医院",
            "南京阳光肿瘤医院"
        ],
        "泰州": [
            "江苏泰州红房子医院",
            "泰州海陵女子医院",
            "泰州市海陵医院"
        ],
        "苏州": [
            "常熟东方妇科医院",
            "常熟市仁爱医院",
            "昆山虹桥医院",
            "昆山阳光医院",
            "苏州东吴医院",
            "苏州华美美莱整形医院",
            "苏州圣爱医院",
            "苏州新医科",
            "张家港朝阳五官科医院"
        ],
        "盐城": [
            "盐城协和康复医院"
        ],
        "南通": [
            "江苏海安华山医院",
            "南通和美家妇产科医院",
            "南通长城医院"
        ],
        "宿迁": [
            "宿迁市妇产医院"
        ]
    },
    "新疆维吾尔自治区": {
        "乌鲁木齐": [
            "乌鲁木齐爱德华医院"
        ],
        "伊犁哈萨克": [
            "伊犁阳光女子医院"
        ]
    },
    "福建省": {
        "龙岩": [
            "龙岩女子医院",
            "龙岩阳光医院"
        ],
        "福州": [
            "福清阳光女子医院",
            "福州东南女子医院",
            "福州福兴妇产医院",
            "福州鼓楼医院",
            "福州华美美莱整形医院",
            "福州现代妇产医院",
            "福州誉盛医院",
            "福州左海医院"
        ],
        "厦门": [
            "厦门登特口腔医院",
            "厦门友好妇科"
        ],
        "泉州": [
            "泉州华美美莱整形医院",
            "泉州坤如玛丽医院",
            "泉州南亚医院",
            "泉州新阳光女子医院"
        ],
        "莆田": [
            "莆田丽人妇科医院",
            "莆田盛兴医院",
            "莆田中西医肛肠医院"
        ]
    },
    "浙江省": {
        "宁波": [
            "宁波博爱医院",
            "宁波虹桥医院",
            "宁波美莱整形美容医院",
            "宁波欧亚男科医院"
        ],
        "温州": [
            "瑞安华东医院",
            "温州爱尔五官科医院",
            "温州红旗医院",
            "温州建国医院",
            "温州协和医院",
            "温州长庚耳鼻喉医院",
            "温州长征医院"
        ],
        "台州": [
            "温岭和平医院"
        ],
        "嘉兴": [
            "嘉兴博爱医院",
            "嘉兴曙光中西医结合医院",
            "嘉兴新安国际医院"
        ],
        "舟山": [
            "舟山市千岛医院妇产科",
            "舟山现代妇科医院"
        ],
        "慈溪": [
            "慈溪圣爱医院"
        ],
        "杭州": [
            "杭州阿波罗男子医院",
            "杭州广仁医院",
            "杭州虹桥医院",
            "杭州建国医院",
            "杭州玛莉亚妇女医院",
            "杭州天目山医院",
            "杭州真爱医院"
        ],
        "湖州": [
            "湖州阳光女子医院"
        ],
        "金华": [
            "浙江金华博康生殖医院"
        ]
    },
    "湖北省": {
        "武汉": [
            "武汉当代佳丽医院",
            "武汉华美医院",
            "武汉华仁医院",
            "武汉华夏医院",
            "武汉现代女子妇科医院",
            "武汉阳光女子医院"
        ],
        "黄石": [
            "黄石华中福康医院"
        ],
        "荆州": [
            "荆州华康医院"
        ]
    },

    "江西省": {
        "上饶": [
            "上饶东大肛肠专科医院",
            "上饶协和医院"
        ],
        "九江": [
            "九江玛丽亚医院",
            "九江新世纪医院",
            "九江阳光女子医院"
        ],
        "南昌": [
            "南昌博爱泌尿专科医院",
            "南昌博大耳鼻咽喉专科医院",
            "南昌东大肛肠专科医院",
            "南昌华山不孕不育医院",
            "南昌佳美美容医院",
            "南昌仁爱女子医院",
            "南昌市第五医院",
            "南昌曙光手足外科医院"
        ],
        "萍乡": [
            "萍乡妇科医院",
            "萍乡市新世纪泌尿专科医院"
        ],
        "赣州": [
            "赣州现代泌尿专科医院"
        ]
    },
    "黑龙江省": {
        "哈尔滨": [
            "哈尔滨欧亚男科医院",
            "哈尔滨市生殖保健中心院",
            "黑龙江哈尔滨东北医院",
            "黑龙江和美妇产医院",
            "黑龙江和平医院",
            "黑龙江玛丽亚妇产医院",
            "黑龙江阳光女子医院",
            "黑龙江长庚耳鼻喉医院"
        ]
    },
    "广东省": {
        "广州": [
            "广东民安医院",
            "广州番禺东方俪人医院",
            "广州番禺玛莉亚肛肠医院",
            "广州花都人爱医院",
            "广州济慈医院",
            "广州现代医院",
            "广州益寿医院",
            "广州远东美容医院",
            "广州长安医院",
            "广州长泰医院"
        ],
        "佛山": [
            "佛山三水女子医院",
            "佛山市顺德区大良阳光康复医院",
            "佛山顺德广济中医院",
            "佛山顺德新世纪泌尿医院",
            "佛山顺德庄头医院"
        ],
        "东莞": [
            "东莞常平医院",
            "东莞东方泌尿专科医院",
            "东莞康桥妇科医院",
            "东莞南华妇科医院",
            "东莞塘厦同仁妇产医院",
            "东莞万福妇产医院",
            "东莞乌沙医院",
            "东莞现代妇科医院"
        ],
        "汕头": [
            "汕头妇产医院"
        ],
        "深圳": [
            "深圳博爱医院",
            "深圳凤凰医院",
            "深圳福华中西医结合医院",
            "深圳韩美医疗美容医院",
            "深圳和美妇儿科医院",
            "深圳华南妇科医院",
            "深圳建国泌尿外科医院",
            "深圳健安医院",
            "深圳健丰医院",
            "深圳龙济医院",
            "深圳罗岗医院",
            "深圳美莱美容医院",
            "深圳仁爱医院",
            "深圳仁康医院",
            "深圳曙光医院",
            "深圳同仁妇科医院",
            "深圳雪象医院",
            "深圳阳光医院",
            "深圳远东妇儿科医院"
        ],
        "肇庆": [
            "肇庆福康医院"
        ],
        "中山": [
            "中山百佳妇产医院",
            "中山市国丹中医院",
            "中山阳光医院"
        ],
        "珠海": [
            "珠海惠爱医院",
            "珠海九龙医院",
            "珠海阳光医院"
        ],
        "江门": [
            "江门玛丽妇科医院"
        ],
        "惠州": [
            "惠阳女子医院",
            "惠州东江泌尿专科医院",
            "惠州仁德妇科医院"
        ]
    },
    "云南省": {
        "曲靖": [
            "曲靖富源阳光医院",
            "曲靖九州医院"
        ],
        "玉溪": [
            "玉溪九州医院"
        ],
        "昆明": [
            "解放军478医院妇产中心",
            "昆明华美美莱整形医院",
            "昆明九州医院",
            "昆明玛莉亚女子医院",
            "昆明仁爱医院",
            "昆明西昌路医院",
            "昆明阳光医院"
        ]
    },

    "广西壮族自治区": {
        "柳州": [
            "柳州福康医院"
        ]
    },
    "陕西省": {
        "西安": [
            "西安俪人医院"
        ]
    },
    "甘肃省": {
        "兰州": [
            "兰州仁和医院"
        ]
    },
    "河北省": {
        "石家庄": [
            "河北东方中西医结合医院"
        ],
        "河北": [
            "唐山女子医院"
        ],
        "廊坊": [
            "廊坊世纪协和医院",
            "廊坊万福医院"
        ],
        "保定": [
            "保定世纪协和医院",
            "保定现代女子医院"
        ]
    },
    "宁夏回族自治区": {
        "银川": [
            "宁夏西京妇产医院"
        ]
    },
    "重庆市": {
        "重庆": [
            "重庆爱瑞阳光眼科医院",
            "重庆北大阳光医院",
            "重庆都市丽人医院",
            "重庆涪陵和美妇产医院",
            "重庆涪陵三峡医院",
            "重庆红十字会医院",
            "重庆华美美莱整形医院",
            "重庆坤如玛丽医院",
            "重庆生殖健康医院",
            "重庆市爱德华医院",
            "重庆市万州华美紫馨整形美容医院",
            "重庆万州和美妇产医院",
            "重庆五洲女子医院",
            "重庆现代女子医院",
            "解放军第324医院"
        ]
    },
    "吉林省": {
        "延边": [
            "延吉博生现代妇科医院"
        ],
        "长春": [
            "长春同济医院",
            "长春阳光口腔医院",
            "长春阳光女子医院",
            "长春长庚耳鼻喉医院"
        ]
    },
    "湖南省": {
        "郴州": [
            "湖南郴州福康医院"
        ],
        "娄底": [
            "娄底阳光医院"
        ],
        "长沙": [
            "长沙博大泌尿专科医院",
            "长沙恒生手外科医院",
            "长沙华夏医院",
            "长沙丽人妇产医院",
            "长沙南方骨外科医院",
            "长沙年轮骨科医院",
            "长沙仁爱医院",
            "长沙现代女子医院",
            "长沙湘江医院七大医院",
            "长沙阳光医院"
        ],
        "湘潭": [
            "湘潭阳光眼科中心"
        ]
    },
    "安徽省": {
        "芜湖": [
            "芜湖丹凤朝阳妇科医院",
            "芜湖阳光眼科医院"
        ],
        "巢湖": [
            "巢湖康平妇产医院"
        ],
        "亳州": [
            "涡阳阳光医院"
        ],
        "蚌埠": [
            "蚌埠市澳美佳女子医院"
        ],
        "淮北": [
            "淮北女子医院"
        ]
    },
    "内蒙古自治区": {
        "包头": [
            "包头现代女子妇产医院"
        ],
        "呼和浩特": [
            "呼和浩特五洲女子医院",
            "内蒙古天骄医院"
        ],
        "乌海": [
            "乌海现代医院"
        ]
    },
    "上海市": {
        "上海": [
            "江东泌尿外科医院",
            "解放军411医院",
            "上海阿波罗男子医院",
            "上海安平医院",
            "上海安贞医院",
            "上海博爱医院",
            "上海博大医院",
            "上海城市女子医院",
            "上海福华医院",
            "上海虹桥医院",
            "上海沪申五官科医院",
            "上海华美美莱整形医院",
            "上海健桥医院",
            "上海九龙男子医院",
            "上海九州泌尿医院",
            "上海康新医院",
            "上海玛丽女子医院",
            "上海玫瑰女子医院",
            "上海南浦妇科医院",
            "上海青城医院",
            "上海仁爱医院",
            "上海圣爱医院",
            "上海天大医疗美容医院",
            "上海同德医院",
            "上海万众医院",
            "上海西郊骨科医院",
            "上海新虹桥医院",
            "上海英港泌尿外科医院",
            "上海远大心胸医院",
            "上海长虹医院",
            "上海长江医院",
            "上海真爱女子医院",
            "上海真美妇科医院",
            "上海中亚医院"
        ]
    },
    "山西省": {
        "临汾": [
            "临汾现代女子医院"
        ],
        "太原": [
            "山西民生医院",
            "山西现代妇产医院",
            "山西新阳光妇科医院",
            "山西长庚耳鼻喉医院",
            "太原白癜风医院",
            "太原糖尿病专科医院",
            "太原新医医院",
            "太原益民中医院"
        ],
        "长治": [
            "长治女子医院"
        ],
        "晋城": [
            "晋城生殖医院",
            "晋城现代女子医院"
        ],
        "阳泉": [
            "阳泉博大中医皮肤病医院"
        ],
        "大同": [
            "大同新时代妇科医院"
        ],
        "运城": [
            "运城禹都人民医院"
        ]
    },
    "西藏自治区": {
        "拉萨": [
            "拉萨北大泌尿生殖医院",
            "拉萨阳光妇产医院",
            "拉萨阳光泌尿生殖医院",
            "西藏五洲医院"
        ]
    },
    "辽宁省": {
        "大连": [
            "大连阳光医院",
            "大连长城妇科医院"
        ],
        "沈阳": [
            "解放军沈阳463医院希美整形美容",
            "辽宁省武警总队医院军人服务社",
            "沈阳北陵医院",
            "沈阳曙光男科医院"
        ]
    }
};